/*
https://stepik.org/lesson/307329/step/7?unit=289417

Рюкзак5

У вас есть nn слитков золота, каждый имеет свой вес и стоимость. Также у вас есть рюкзак вместимости SS. Необходимо вычислить максимальную суммарную стоимость слитков, которую вы можете получить. Вы не можете дробить слитки.

Входные данные

В первой строке записано два целых числа SS и NN (1 \leq S \leq 10^41≤S≤10 
4
 ; 1 \leq N \leq 3001≤N≤300).

Во второй строке записаны nn целых чисел - веса слитков. Каждый слиток имеет неотрицательный вес, не превосходящий 10^510 
5
 .

В третьей строке записаны еще nn целых чисел - стоимости слитков. Каждый слиток имеет неотрицательную стоимость, не превосходящую 10^510 
5
 .

Выходные данные

Выведите единственное число - максимальную суммарную стоимость, которую вы можете унести.

Sample Input:

8 4
2 4 4 7
2 5 5 9
Sample Output:

10


*/
